![cover](cover/08.%20Interpolate%20Function.png)

#### Outline
* Method
  * Linear
  * Nearest
  * Polynomial
  * Time
* Limit
  * Limit Direction
  * Limit Area
* Inplace

### Interpolate Function

The interpolate function is used to fill in missing numerical values in dataframes by estimating them based on existing data

`You will need to pip install SciPy for some of these functions to work`

##### Import Pandas

In [1]:
import pandas

##### Import Datasets

In [2]:
revision = pandas.read_csv('./datasets/revision.csv')
machine = pandas.read_csv('./datasets/machine_output.csv', parse_dates=['time'])    # parsing the 'time' column into date_time values
machine.set_index('time', inplace=True)                                             # set machine index to the 'time' column

### Method

`method = ''`

Species the method used to interpolate the values in the data

In [3]:
revision

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

In [4]:
machine

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0        85.0
2025-11-08 01:30:00    231.0      4.6   NaN  1520.0         NaN
2025-11-08 02:45:00    232.0      NaN  48.0     NaN         NaN
2025-11-08 03:05:00      NaN      4.8  49.0  1550.0        87.0
2025-11-08 06:21:00      NaN      4.9   NaN  1560.0        88.0
2025-11-08 08:56:00      NaN      5.6  57.0  1660.0         NaN
2025-11-08 09:28:00    235.0      4.9   NaN  1570.0        89.0
2025-11-08 10:10:00    238.0      NaN  54.0  1600.0         NaN
2025-11-08 10:31:00    242.0      5.3  56.0  1640.0        90.0
2025-11-08 11:56:00    244.0      5.6  57.0  1660.0         NaN

#### Linear  - (Default)

`method = 'linear'`

Ignore the index and treat the values as equally spaced

In [5]:
revision.interpolate()  # since linear is the default, we do not have to specify the method

   student_id       math    science  english  study_hours  sleep_hours
0           1        NaN  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10  92.000000  75.000000     91.0          3.0          4.0

In [6]:
revision.interpolate(method='linear')   # we can compare the values, they are the same when specifying and not specifying the linear method

   student_id       math    science  english  study_hours  sleep_hours
0           1        NaN  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10  92.000000  75.000000     91.0          3.0          4.0

In [7]:
machine.interpolate(method='linear')    # we can do the same with the machine dataset

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0   85.000000
2025-11-08 01:30:00   231.00      4.6  46.5  1520.0   85.666667
2025-11-08 02:45:00   232.00      4.7  48.0  1535.0   86.333333
2025-11-08 03:05:00   232.75      4.8  49.0  1550.0   87.000000
2025-11-08 06:21:00   233.50      4.9  53.0  1560.0   88.000000
2025-11-08 08:56:00   234.25      5.6  57.0  1660.0   88.500000
2025-11-08 09:28:00   235.00      4.9  55.5  1570.0   89.000000
2025-11-08 10:10:00   238.00      5.1  54.0  1600.0   89.500000
2025-11-08 10:31:00   242.00      5.3  56.0  1640.0   90.000000
2025-11-08 11:56:00   244.00      5.6  57.0  1660.0   90.000000

In [8]:
machine.interpolate(method='linear')    # values are identical

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0   85.000000
2025-11-08 01:30:00   231.00      4.6  46.5  1520.0   85.666667
2025-11-08 02:45:00   232.00      4.7  48.0  1535.0   86.333333
2025-11-08 03:05:00   232.75      4.8  49.0  1550.0   87.000000
2025-11-08 06:21:00   233.50      4.9  53.0  1560.0   88.000000
2025-11-08 08:56:00   234.25      5.6  57.0  1660.0   88.500000
2025-11-08 09:28:00   235.00      4.9  55.5  1570.0   89.000000
2025-11-08 10:10:00   238.00      5.1  54.0  1600.0   89.500000
2025-11-08 10:31:00   242.00      5.3  56.0  1640.0   90.000000
2025-11-08 11:56:00   244.00      5.6  57.0  1660.0   90.000000

#### Nearest

`method = 'nearest'`

Fills in values with the closest non-missing value

In [9]:
revision

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

In [10]:
revision.interpolate(method='nearest')  # missing values are estimated by using the nearest non-missing value to them

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0     65.0     78.0          3.0          8.0
2           3  72.0     67.0     79.0          3.0          6.0
3           4  77.0     68.0     75.0          4.0          5.0
4           5  77.0     68.0     82.0          5.0          5.0
5           6  88.0     72.0     93.0          6.0          8.0
6           7  90.0     72.0     93.0          6.0          7.0
7           8  90.0     73.0     89.0          5.0          6.0
8           9  92.0     73.0     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

#### Polynomial

`method = 'polynomial', order = n`

Uses polynomial interpolation of the specified order

In [11]:
machine

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0        85.0
2025-11-08 01:30:00    231.0      4.6   NaN  1520.0         NaN
2025-11-08 02:45:00    232.0      NaN  48.0     NaN         NaN
2025-11-08 03:05:00      NaN      4.8  49.0  1550.0        87.0
2025-11-08 06:21:00      NaN      4.9   NaN  1560.0        88.0
2025-11-08 08:56:00      NaN      5.6  57.0  1660.0         NaN
2025-11-08 09:28:00    235.0      4.9   NaN  1570.0        89.0
2025-11-08 10:10:00    238.0      NaN  54.0  1600.0         NaN
2025-11-08 10:31:00    242.0      5.3  56.0  1640.0        90.0
2025-11-08 11:56:00    244.0      5.6  57.0  1660.0         NaN

In [12]:
machine.interpolate(method='polynomial', order=2)   # 2nd order polynomial

                        voltage   current       temp          rpm  efficiency
time
2025-11-08 00:30:00         NaN  4.500000  45.000000  1500.000000   85.000000
2025-11-08 01:30:00  231.000000  4.600000  45.499869  1520.000000   85.918302
2025-11-08 02:45:00  232.000000  4.774929  48.000000  1546.459248   86.810197
2025-11-08 03:05:00  232.175342  4.800000  49.000000  1550.000000   87.000000
2025-11-08 06:21:00  231.894451  4.900000  58.812159  1560.000000   88.000000
2025-11-08 08:56:00  233.865810  5.600000  57.000000  1660.000000   88.651860
2025-11-08 09:28:00  235.000000  4.900000  54.723895  1570.000000   89.000000
2025-11-08 10:10:00  238.000000  5.062325  54.000000  1600.000000   89.620305
2025-11-08 10:31:00  242.000000  5.300000  56.000000  1640.000000   90.000000
2025-11-08 11:56:00  244.000000  5.600000  57.000000  1660.000000         NaN

In [13]:
machine.interpolate(method='polynomial', order=3)   # 3rd order polynomial

                        voltage   current       temp          rpm  efficiency
time
2025-11-08 00:30:00         NaN  4.500000  45.000000  1500.000000   85.000000
2025-11-08 01:30:00  231.000000  4.600000  45.345789  1520.000000   85.947918
2025-11-08 02:45:00  232.000000  4.789142  48.000000  1548.500147   86.818483
2025-11-08 03:05:00  232.137765  4.800000  49.000000  1550.000000   87.000000
2025-11-08 06:21:00  232.401631  4.900000  59.226099  1560.000000   88.000000
2025-11-08 08:56:00  234.140466  5.600000  57.000000  1660.000000   88.672688
2025-11-08 09:28:00  235.000000  4.900000  54.588381  1570.000000   89.000000
2025-11-08 10:10:00  238.000000  4.960709  54.000000  1600.000000   89.606971
2025-11-08 10:31:00  242.000000  5.300000  56.000000  1640.000000   90.000000
2025-11-08 11:56:00  244.000000  5.600000  57.000000  1660.000000         NaN

In [14]:
machine.interpolate(method='polynomial', order=4)   # 4th order polynomial

                        voltage   current       temp          rpm  efficiency
time
2025-11-08 00:30:00         NaN  4.500000  45.000000  1500.000000   85.000000
2025-11-08 01:30:00  231.000000  4.600000  46.187935  1520.000000   85.904814
2025-11-08 02:45:00  232.000000  4.826621  48.000000  1555.120338   86.807000
2025-11-08 03:05:00  234.487647  4.800000  49.000000  1550.000000   87.000000
2025-11-08 06:21:00  251.991059  4.900000  66.650336  1560.000000   88.000000
2025-11-08 08:56:00  236.421999  5.600000  57.000000  1660.000000   88.677741
2025-11-08 09:28:00  235.000000  4.900000  54.019628  1570.000000   89.000000
2025-11-08 10:10:00  238.000000  4.851387  54.000000  1600.000000   89.603550
2025-11-08 10:31:00  242.000000  5.300000  56.000000  1640.000000   90.000000
2025-11-08 11:56:00  244.000000  5.600000  57.000000  1660.000000         NaN

#### Time

`method = 'time'`

Works on daily and higher resolution data to interpolate given length of interval

`dataset.set_index('time', inplace=True)`

In [15]:
machine

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0        85.0
2025-11-08 01:30:00    231.0      4.6   NaN  1520.0         NaN
2025-11-08 02:45:00    232.0      NaN  48.0     NaN         NaN
2025-11-08 03:05:00      NaN      4.8  49.0  1550.0        87.0
2025-11-08 06:21:00      NaN      4.9   NaN  1560.0        88.0
2025-11-08 08:56:00      NaN      5.6  57.0  1660.0         NaN
2025-11-08 09:28:00    235.0      4.9   NaN  1570.0        89.0
2025-11-08 10:10:00    238.0      NaN  54.0  1600.0         NaN
2025-11-08 10:31:00    242.0      5.3  56.0  1640.0        90.0
2025-11-08 11:56:00    244.0      5.6  57.0  1660.0         NaN

In [16]:
machine.interpolate(method='time')  # takes into account the differences in time when estimating values (only possible for datasets with formatted date-time columns as the index)

                        voltage   current       temp          rpm  efficiency
time
2025-11-08 00:30:00         NaN  4.500000  45.000000  1500.000000   85.000000
2025-11-08 01:30:00  231.000000  4.600000  46.333333  1520.000000   85.774194
2025-11-08 02:45:00  232.000000  4.757895  48.000000  1543.684211   86.741935
2025-11-08 03:05:00  232.148883  4.800000  49.000000  1550.000000   87.000000
2025-11-08 06:21:00  233.607940  4.900000  53.467236  1560.000000   88.000000
2025-11-08 08:56:00  234.761787  5.600000  57.000000  1660.000000   88.828877
2025-11-08 09:28:00  235.000000  4.900000  55.702703  1570.000000   89.000000
2025-11-08 10:10:00  238.000000  5.166667  54.000000  1600.000000   89.666667
2025-11-08 10:31:00  242.000000  5.300000  56.000000  1640.000000   90.000000
2025-11-08 11:56:00  244.000000  5.600000  57.000000  1660.000000   90.000000

### Limit

`limit = n`

Specifies the maximum number of rows per/column/gap we can fill, given by `n`

In [17]:
revision

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

In [18]:
revision.interpolate(limit=1)   # estimates only one value per gap

   student_id       math    science  english  study_hours  sleep_hours
0           1        NaN  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4        NaN  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000        NaN     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10  92.000000  75.000000     91.0          3.0          4.0

In [19]:
machine

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0        85.0
2025-11-08 01:30:00    231.0      4.6   NaN  1520.0         NaN
2025-11-08 02:45:00    232.0      NaN  48.0     NaN         NaN
2025-11-08 03:05:00      NaN      4.8  49.0  1550.0        87.0
2025-11-08 06:21:00      NaN      4.9   NaN  1560.0        88.0
2025-11-08 08:56:00      NaN      5.6  57.0  1660.0         NaN
2025-11-08 09:28:00    235.0      4.9   NaN  1570.0        89.0
2025-11-08 10:10:00    238.0      NaN  54.0  1600.0         NaN
2025-11-08 10:31:00    242.0      5.3  56.0  1640.0        90.0
2025-11-08 11:56:00    244.0      5.6  57.0  1660.0         NaN

In [20]:
machine.interpolate(limit=2)    # estimates only two values per gap

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0   85.000000
2025-11-08 01:30:00   231.00      4.6  46.5  1520.0   85.666667
2025-11-08 02:45:00   232.00      4.7  48.0  1535.0   86.333333
2025-11-08 03:05:00   232.75      4.8  49.0  1550.0   87.000000
2025-11-08 06:21:00   233.50      4.9  53.0  1560.0   88.000000
2025-11-08 08:56:00      NaN      5.6  57.0  1660.0   88.500000
2025-11-08 09:28:00   235.00      4.9  55.5  1570.0   89.000000
2025-11-08 10:10:00   238.00      5.1  54.0  1600.0   89.500000
2025-11-08 10:31:00   242.00      5.3  56.0  1640.0   90.000000
2025-11-08 11:56:00   244.00      5.6  57.0  1660.0   90.000000

#### Limit Direction

`limit_direction = ''`

Specifies the direction upon which the limit direction is imposed:

* `forward` - from the data ahead
* `backward` - from the data before
* `both` - from both directions

In [21]:
revision

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

In [22]:
revision.interpolate(limit_direction='forward') # values are estimated based on non-missing values from above

   student_id       math    science  english  study_hours  sleep_hours
0           1        NaN  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10  92.000000  75.000000     91.0          3.0          4.0

In [23]:
revision.interpolate(limit_direction='backward')    # values are estimated based on non-missing values from below

   student_id       math    science  english  study_hours  sleep_hours
0           1  72.000000  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10        NaN  75.000000     91.0          3.0          4.0

In [24]:
revision.interpolate(limit_direction='both')    # values are estimated based on non-missing values from both directions

   student_id       math    science  english  study_hours  sleep_hours
0           1  72.000000  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10  92.000000  75.000000     91.0          3.0          4.0

#### limit_area

`limit_area = ''`

Specifies if we should fill values outside the known range of values or within it:

* `inside`: Only fill NaNs surrounded by valid values (interpolate)
* `outside`: Only fill NaNs outside valid values (extrapolate)

`linear method does NOT extrapolate`

In [25]:
machine

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0        85.0
2025-11-08 01:30:00    231.0      4.6   NaN  1520.0         NaN
2025-11-08 02:45:00    232.0      NaN  48.0     NaN         NaN
2025-11-08 03:05:00      NaN      4.8  49.0  1550.0        87.0
2025-11-08 06:21:00      NaN      4.9   NaN  1560.0        88.0
2025-11-08 08:56:00      NaN      5.6  57.0  1660.0         NaN
2025-11-08 09:28:00    235.0      4.9   NaN  1570.0        89.0
2025-11-08 10:10:00    238.0      NaN  54.0  1600.0         NaN
2025-11-08 10:31:00    242.0      5.3  56.0  1640.0        90.0
2025-11-08 11:56:00    244.0      5.6  57.0  1660.0         NaN

In [26]:
machine.interpolate(limit_area='inside')    # only values inside are filled

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00      NaN      4.5  45.0  1500.0   85.000000
2025-11-08 01:30:00   231.00      4.6  46.5  1520.0   85.666667
2025-11-08 02:45:00   232.00      4.7  48.0  1535.0   86.333333
2025-11-08 03:05:00   232.75      4.8  49.0  1550.0   87.000000
2025-11-08 06:21:00   233.50      4.9  53.0  1560.0   88.000000
2025-11-08 08:56:00   234.25      5.6  57.0  1660.0   88.500000
2025-11-08 09:28:00   235.00      4.9  55.5  1570.0   89.000000
2025-11-08 10:10:00   238.00      5.1  54.0  1600.0   89.500000
2025-11-08 10:31:00   242.00      5.3  56.0  1640.0   90.000000
2025-11-08 11:56:00   244.00      5.6  57.0  1660.0         NaN

In [27]:
machine.interpolate(limit_area='outside', limit_direction='both')   # only edge values are filled

                     voltage  current  temp     rpm  efficiency
time
2025-11-08 00:30:00    231.0      4.5  45.0  1500.0        85.0
2025-11-08 01:30:00    231.0      4.6   NaN  1520.0         NaN
2025-11-08 02:45:00    232.0      NaN  48.0     NaN         NaN
2025-11-08 03:05:00      NaN      4.8  49.0  1550.0        87.0
2025-11-08 06:21:00      NaN      4.9   NaN  1560.0        88.0
2025-11-08 08:56:00      NaN      5.6  57.0  1660.0         NaN
2025-11-08 09:28:00    235.0      4.9   NaN  1570.0        89.0
2025-11-08 10:10:00    238.0      NaN  54.0  1600.0         NaN
2025-11-08 10:31:00    242.0      5.3  56.0  1640.0        90.0
2025-11-08 11:56:00    244.0      5.6  57.0  1660.0        90.0

In [28]:
revision

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

In [29]:
revision.interpolate(limit_area='inside')    # only values inside are filled

   student_id       math    science  english  study_hours  sleep_hours
0           1        NaN  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10        NaN  75.000000     91.0          3.0          4.0

In [30]:
revision.interpolate(limit_area='outside', limit_direction='both')   # only edge values are filled

   student_id  math  science  english  study_hours  sleep_hours
0           1  72.0     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10  92.0     75.0     91.0          3.0          4.0

### Inplace

Specifies if we should update the current dataset or create a new one when using the fillna method

In [31]:
revision    # the original dataframe

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

In [32]:
revision.interpolate()  # creates a new variable for use

   student_id       math    science  english  study_hours  sleep_hours
0           1        NaN  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10  92.000000  75.000000     91.0          3.0          4.0

In [33]:
revision    # but the original variable remains unchanged

   student_id  math  science  english  study_hours  sleep_hours
0           1   NaN     65.0     75.0          2.0          8.0
1           2  72.0      NaN     78.0          3.0          NaN
2           3   NaN     67.0     79.0          NaN          6.0
3           4   NaN     68.0     75.0          4.0          5.0
4           5  77.0      NaN     82.0          5.0          NaN
5           6  88.0      NaN     93.0          6.0          8.0
6           7  90.0     72.0      NaN          6.0          7.0
7           8   NaN     73.0     89.0          5.0          6.0
8           9  92.0      NaN     90.0          4.0          5.0
9          10   NaN     75.0     91.0          3.0          4.0

In [34]:
revision.interpolate(inplace=True)  # this allows us to change the variable when using the function

In [35]:
revision    # now the variable has changed when viewing again

   student_id       math    science  english  study_hours  sleep_hours
0           1        NaN  65.000000     75.0          2.0          8.0
1           2  72.000000  66.000000     78.0          3.0          7.0
2           3  73.666667  67.000000     79.0          3.5          6.0
3           4  75.333333  68.000000     75.0          4.0          5.0
4           5  77.000000  69.333333     82.0          5.0          6.5
5           6  88.000000  70.666667     93.0          6.0          8.0
6           7  90.000000  72.000000     91.0          6.0          7.0
7           8  91.000000  73.000000     89.0          5.0          6.0
8           9  92.000000  74.000000     90.0          4.0          5.0
9          10  92.000000  75.000000     91.0          3.0          4.0

### For Source code:
https://sites.google.com/view/aorbtech/programming/

#### @Aorb Tech